# GetPointBufferPointer Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCollection..::..GetPointBufferPointer Method
PointCollection Class See Also
---
Returns an unsafe pointer to the buffer in which this collection stores the points.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IntPtr GetPointBufferPointer()
```

Visual Basic
---
```text
Public Function GetPointBufferPointer As IntPtr
```

Visual C++
---
```text
public:
IntPtr GetPointBufferPointer()
```

# ### Return Value
The pointer to the collection's storage.
# See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace